runTestCases/initialCases/4_NACA0012_AOA15/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "15000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
3584
(
7.031823e-06
6.7737053e-06
4.0410422e-07
5.8300873e-06
3.8319026e-07
1.0819442e-07
5.051463e-06
3.2199913e-07
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            freestream;
        freestreamValue uniform 4.5e-5;
        value           uniform 4.5e-5; 
    }
    outlet
    {
        type            freestream;
        freestreamValue uniform 4.5e-5;
        value           nonuniform List<scalar> 
64
(
1.1184519e-05
0.00010022538
0.00032916927
0.00038027405
0.00013453279
1.2707075e-05
4.0120179e-07
5.3631967e-08
...
)
;
    }
    wall
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
64
(
0.14088549
0.14940964
0.12972884
0.11934075
0.11317692
0.10848853
0.10532979
0.10230987
...
)
;
    }
}


// ************************************************************************* //
