runTestCases/initialCases/4_NACA0012_AOA15/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "15000";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
3584
(
6.3420308e-08
6.3483845e-08
5.1092081e-08
6.3589731e-08
5.1086927e-08
4.1473663e-08
6.334508e-08
4.8795388e-08
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            freestream;
        freestreamValue uniform 7.8117e-08;
        value           nonuniform List<scalar> 
112
(
7.8117e-08
7.8117e-08
7.8117e-08
7.8117e-08
7.8117e-08
7.8117e-08
7.8117e-08
7.8117e-08
...
)
;
    }
    outlet
    {
        type            freestream;
        freestreamValue uniform 7.8117e-08;
        value           nonuniform List<scalar> 
64
(
9.1572365e-06
9.0088412e-05
0.00028291443
0.00028752177
9.7690653e-05
8.9112713e-06
2.8193469e-07
3.7646686e-08
...
)
;
    }
    wall
    {
        type            nutUSpaldingWallFunction;
        value           nonuniform List<scalar> 
64
(
1.5190273e-09
1.4262035e-09
1.2134443e-09
1.0936221e-09
1.0188636e-09
9.6470468e-10
9.2720387e-10
8.9588675e-10
...
)
;
    }
}


// ************************************************************************* //
