runTestCases/initialCases/4_NACA0012_AOA15/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "15000";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
3584
(
110.87652
106.69967
7.909332
91.682842
7.5007498
2.60875
79.745152
6.5989665
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            freestream;
        freestreamValue uniform 260;
        value           uniform 260; 
    }
    outlet
    {
        type            freestream;
        freestreamValue uniform 260;
        value           nonuniform List<scalar> 
64
(
1.2213858
1.1125224
1.1634941
1.3225922
1.3771306
1.4259554
1.423031
1.4246132
...
)
;
    }
    wall
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           nonuniform List<scalar> 
64
(
25727336
28274635
30480378
32279698
33705988
34818578
35674195
36310735
...
)
;
    }
}


// ************************************************************************* //
